"""
    This script is to crawl food lover
"""

import requests
import pandas as pd
import logging
import time
from typing import List

logging.basicConfig(level = logging.INFO)
logger = logging.getLogger()
logger.setLevel(logging.INFO)

def defined_variables():
    """
        This function is to defined variables
    """
    category_object = ['餐飲', '糕餅', '夜市小吃/市場']
    zone_object = {
        "雙北": ["臺北市", "新北市", "基隆市"],
        "桃竹苗": ["桃園市", "新竹市", "新竹縣", "苗栗縣"],
        "中彰投": ["臺中市", "彰化縣", "南投縣"],
        "雲嘉南": ["雲林縣", "嘉義市", "嘉義縣", "臺南市"],
        "高屏": ["高雄市", "屏東縣"],
        "宜蘭": ["宜蘭縣"],
        "花蓮": ["花蓮縣"],
        "台東": ["臺東縣"],
        "金馬離島": ["澎湖縣", "金門縣", "連江縣"]
    }
    city_object = {
        "臺北市": ["中山區", "中正區", "信義區", "內湖區", "北投區", "南港區", "士林區", "大同區", "大安區", "文山區", "松山區", "萬華區"],
        "新北市": ["三峽區", "三芝區", "三重區", "中和區", "五股區", "八里區", "土城區", "坪林區", "平溪區", "新店區", "新莊區", "板橋區", "林口區", "樹林區", "永和區", "汐止區", "泰山區", "淡水區", "深坑區", "烏來區", "瑞芳區", "石碇區", "石門區", "萬里區", "蘆洲區", "貢寮區", "金山區", "雙溪區", "鶯歌區"],
        "基隆市": ["七堵區", "中山區", "中正區", "仁愛區", "信義區", "安樂區", "暖暖區"],
        "桃園市": ["中壢區", "八德區", "大園區", "大溪區", "平鎮區", "復興區", "新屋區", "桃園區", "楊梅區", "蘆竹區", "觀音區", "龍潭區", "龜山區"],
        "新竹市": ["北區", "東區", "寶山鄉", "尖石鄉", "峨眉鄉", "新埔鎮", "新豐鄉", "橫山鄉", "湖口鄉", "竹北市", "竹東鎮", "芎林鄉", "香山區"],
        "新竹縣": ["五峰鄉", "北埔鄉", "關西鎮"],
        "苗栗縣": ["三灣鄉", "三義鄉", "公館鄉", "卓蘭鎮", "南庄鄉", "大湖鄉", "後龍鎮", "泰安鄉", "獅潭鄉", "竹南鎮", "苑裡鎮", "苗栗市", "西湖鄉", "通霄鎮", "造橋鄉", "銅鑼鄉", "頭份市", "頭屋鄉"],
        "臺中市": ["中區", "北區", "北屯區", "南區", "南屯區", "后里區", "和平區", "外埔區", "大安區", "大甲區", "大肚區", "大里區", "大雅區", "太平區", "新社區", "東勢區", "東區", "梧棲區", "沙鹿區", "清水區", "烏日區", "石岡區", "神岡區", "西區", "西屯區", "豐原區", "霧峰區", "龍井區"],
        "彰化縣": ["二林鎮", "二水鄉", "伸港鄉", "北斗鎮", "和美鎮", "員林市", "埔心鄉", "埔鹽鄉", "埤頭鄉", "大城鄉", "大村鄉", "彰化市", "永靖鄉", "溪州鄉", "溪湖鎮", "田中鎮", "田尾鄉", "社頭鄉", "福興鄉", "秀水鄉", "竹塘鄉", "線西鄉", "芬園鄉", "花壇鄉", "芳苑鄉", "鹿港鎮"],
        "南投縣": ["中寮鄉", "仁愛鄉", "信義鄉", "南投市", "名間鄉", "國姓鄉", "埔里鎮", "水里鄉", "竹山鎮", "草屯鎮", "集集鎮", "魚池鄉", "鹿谷鄉"],
        "雲林縣": ["二崙鄉", "元長鄉", "北港鎮", "口湖鄉", "古坑鄉", "四湖鄉", "土庫鎮", "大埤鄉", "崙背鄉", "斗六市", "斗南鎮", "東勢鄉", "林內鄉", "水林鄉", "臺西鄉", "莿桐鄉", "虎尾鎮", "褒忠鄉", "西螺鎮", "麥寮鄉"],
        "嘉義市": ["東區", "西區"],
        "嘉義縣": ["中埔鄉", "六腳鄉", "大埔鄉", "大林鎮", "太保市", "布袋鎮", "新港鄉", "朴子市", "東石鄉", "梅山鄉", "民雄鄉", "水上鄉", "溪口鄉", "番路鄉", "竹崎鄉", "義竹鄉", "阿里山鄉", "鹿草鄉"],
        "臺南市": ["七股區", "下營區", "中西區", "仁德區", "佳里區", "六甲區", "北區", "北門區", "南區", "善化區", "大內區", "學甲區", "安南區", "安定區", "安平區", "官田區", "將軍區", "山上區", "左鎮區", "後壁區", "新化區", "新市區", "新營區", "東區", "柳營區", "楠西區", "歸仁區", "永康區", "玉井區", "白河區", "西港區", "關廟區", "鹽水區", "麻豆區", "龍崎區"],
        "高雄市": ["三民區", "仁武區", "內門區", "六龜區", "前金區", "前鎮區", "大寮區", "大樹區", "大社區", "小港區", "岡山區", "左營區", "彌陀區", "新興區", "旗山區", "旗津區", "杉林區", "林園區", "桃源區", "梓官區", "楠梓區", "橋頭區", "永安區", "湖內區", "燕巢區", "田寮區", "甲仙區", "美濃區", "苓雅區", "茂林區", "茄萣區", "路竹區", "那瑪夏區", "阿蓮區", "鳥松區", "鳳山區", "鹽埕區", "鼓山區"],
        "屏東縣": ["三地門鄉", "九如鄉", "佳冬鄉", "來義鄉", "內埔鄉", "南州鄉", "屏東市", "恆春鎮", "新園鄉", "新埤鄉", "春日鄉", "東港鎮", "枋寮鄉", "枋山鄉", "林邊鄉", "泰武鄉", "潮州鎮", "牡丹鄉", "獅子鄉", "琉球鄉", "瑪家鄉", "竹田鄉", "萬丹鄉", "萬巒鄉", "車城鄉", "里港鄉", "長治鄉", "霧臺鄉", "高樹鄉", "鹽埔鄉", "麟洛鄉"],
        "宜蘭縣": ["三星鄉", "五結鄉", "冬山鄉", "南澳鄉", "員山鄉", "壯圍鄉", "大同鄉", "宜蘭市", "礁溪鄉", "羅東鎮", "蘇澳鎮", "頭城鎮"],
        "花蓮縣": ["光復鄉", "吉安鄉", "壽豐鄉", "富里鄉", "新城鄉", "玉里鎮", "瑞穗鄉", "秀林鄉", "花蓮市", "萬榮鄉", "豐濱鄉", "鳳林鎮"],
        "臺東縣": ["卑南鄉", "大武鄉", "太麻里鄉", "延平鄉", "成功鎮", "東河鄉", "池上鄉", "海端鄉", "綠島鄉", "臺東市", "蘭嶼鄉", "達仁鄉", "金峰鄉", "長濱鄉", "關山鎮", "鹿野鄉"],
        "澎湖縣": ["七美鄉", "望安鄉", "湖西鄉", "白沙鄉", "西嶼鄉", "馬公市"],
        "金門縣": ["烈嶼鄉", "金城鎮", "金寧鄉", "金沙鎮", "金湖鎮"],
        "連江縣": ["北竿鄉", "南竿鄉", "東引鄉"]
    }
    return category_object, zone_object

def get_data_from_url(
    _url: str,
    _params: dict,
    _retry_times: int = 0
):
    """
        This function is to get data from url
    """
    try:
        if _retry_times:
            logger.info('Retry times: %s', _retry_times)
        delay_time = _retry_times ** 0.6
        time.sleep(delay_time)
        response = requests.get(
            url = _url,
            params = _params
        )
        response.raise_for_status()
        if response.status_code == 200:
            return response.json()
    except Exception as error:
        logger.error(error)
        _retry_times += 1
        get_data_from_url(
            _url = _url,
            _params = _params,
            _retry_times = _retry_times
        )

def write_data_as_csv(
    _all_data: List[dict]
):
    """
        This function is to write data as csv
    """
    df = pd.DataFrame(_all_data).drop(columns = ['index']).reset_index()
    df.to_csv('./data.csv', index = False)

def main():
    """
        This is main function
    """
    try:
        category_object, zone_object = defined_variables()
        all_data = []
        for category in category_object:
            for zone in zone_object.keys():
                for city in zone_object[zone]:
                    logger.info('Crawling: %s %s %s', category, zone, city)
                    url = 'https://foodlover.tw/goodfood/query/shop'
                    params = {
                        "category": category,
                        "zone": zone,
                        "city": city,
                        "pay_tool": ['信用卡', '行動支付', '電子票證']
                    }
                    data = get_data_from_url(
                        _url = url,
                        _params = params
                    )
                    all_data += data
        write_data_as_csv(
            _all_data = all_data
        )
    except:
        raise

if __name__ == '__main__':
    main()